code/D21/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

period 0.1348;

totalTime  #eval{ 3 * $period };
application     pimpleFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         $totalTime;

deltaT          2e-7;

writeControl    adjustableRunTime;

writeInterval   1e-3;

purgeWrite      0;

writeFormat     ascii;

writePrecision  10;

writeCompression off;

timeFormat      fixed;

timePrecision   8;

runTimeModifiable yes;

adjustTimeStep yes;

maxCo 0.2;

maxDeltaT 0.0001;


functions
{
// #include "functionObjects/updateControlDict.H"
#include "functionObjects/surfaceAverage.H"
#include "functionObjects/wallShearStress.H"
#include "functionObjects/osiTawss.H"

//  #includeFunc flowRatePatch(name=proximal_artery)
//  #includeFunc flowRatePatch(name=distal_artery)
//  #includeFunc flowRatePatch(name=vein)

}


// ************************************************************************* //
