code/D21/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
//     p
//     {
//         solver          PCG;
//         preconditioner  DIC;
//         tolerance       1e-05;
//         relTol          0.05;
//     }
    p
    {
        solver          GAMG;
        preconditioner  FDIC;
        mergeLevels     1;
        smoother        GaussSeidel;
        agglomerator    faceAreaPair;
        nCellsInCoarsestLevel  200;
        tolerance       1e-04;
        relTol          0.05;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    U
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-04;
        relTol          0;
    }
    UFinal
    {
        $U
    }
}

PISO
{
    nCorrectors     2;
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       0;
}

PIMPLE
{
    nOuterCorrectors 5;
    nCorrectors     2;
    nNonOrthogonalCorrectors 1;
    pRefCell        0;
    pRefValue       0;
    
    residualControl
    {
        U
        {
                tolerance  1e-4;
                relTol      0;
        }

     }    
}
// ************************************************************************* //
