code/D21/system/probes_fistula
probes_fistula
{
    type            probes;
    libs            (sampling);

    // Name of the directory for probe data
    name            probes;

    // Write at same frequency as fields
    writeControl    outputTime;
    writeInterval   1;
    setFormat raw;
    surfaceFormat raw;

    // Fields to be probed
    fields          (U "p.*");

    // Optional: do not recalculate cells if mesh moves
    // Only cell interpolation can be applied when not using fixedLocations. 
    // InterpolationScheme entry will be ignored
    fixedLocations  true;

    // Optional: interpolation scheme to use (default is cell)
    interpolationScheme cellPoint;

    probeLocations
    (
		(0.0017355962991714	-0.034451885223388996	0.0027725169658661)
		(0.0017701901197433002	-0.034357894897461	0.0027716560363770003)
		(0.0018274459838867002	-0.034278156280517995	0.0027470757961273)
		(0.0018834977149963	-0.034195907592772995	0.0027317888736725)
		(0.0019164535999298	-0.034103172302246	0.0027546100616454997)
		(0.0019543149471283	-0.034017360687256006	0.0027916905879974002)
		(0.0019964411258698	-0.03394441986084	0.0028471994400024003)
		(0.0020374069213867003	-0.033880378723145	0.0029129841327667)
		(0.0020848984718322998	-0.03383377456665	0.0029889459609985)
		(0.0021349070072174	-0.03381037902832	0.0030737915039062)
		(0.0021882898807526	-0.033803623199463	0.0031596145629883)
		(0.0022548136711121	-0.033814121246338	0.0032328045368195005)
		(0.0023325080871582	-0.0338346824646	0.0032937033176422)
		(0.0024122846126556	-0.033852745056152	0.003353184223175)
		(0.00249494099617	-0.033867046356201004	0.0034099848270416)
		(0.0025772371292114003	-0.03388525390625	0.0034658617973328002)
		(0.0026605510711670004	-0.033900787353516	0.0035207788944244)
		(0.0027434742450714	-0.033911579132080004	0.0035779156684875003)
		(0.0028282101154327	-0.033912635803223	0.0036333537101746003)
		(0.0029072554111481	-0.033923831939697	0.0036952188014984003)
		(0.0029875068664551	-0.033934875488281	0.0037560336589813003)
		(0.0030685029029846	-0.03394165802002	0.0038165056705475)
		(0.0031427772045135	-0.033949127197266005	0.003884881734848)
		(0.0032185921669006003	-0.03395503616333	0.003951516866684)
		(0.0033018827438354	-0.033949798583983996	0.004008969783783)
		(0.0033833861351013003	-0.033947616577147996	0.0040690498352051)
		(0.0034636514186859	-0.033947353363037	0.0041308507919312005)
		(0.0035460207462311	-0.033943023681641	0.0041896457672119)
		(0.0036303954124451	-0.033935878753662004	0.0042450823783875)
		(0.0037171614170074	-0.033928199768066	0.0042966284751892)
		(0.0038083908557892004	-0.033924129486084	0.0043402075767517)
		(0.0039033873081207	-0.033917793273926	0.0043748331069946)
		(0.0039978954792023	-0.033910930633545	0.0044105644226074)
		(0.0040921635627747	-0.033908679962157996	0.0044475989341736)
		(0.0041851906776428005	-0.033900840759277004	0.0044868822097778)
		(0.0042717776298523006	-0.033880138397217006	0.0045347628593445)
		(0.0043544130325317	-0.033845485687256004	0.0045816588401794)
		(0.0044369506835938	-0.033800224304198996	0.004619059562683101)
		(0.0045208492279053	-0.033758853912353996	0.0046580152511597)
		(0.004601044178009	-0.033709632873535	0.0046951260566711)
		(0.0046788387298584005	-0.033649234771729	0.004718633174896201)
		(0.0047558035850525	-0.033585639953612995	0.0047354936599731)
		(0.0048346800804138	-0.033522876739502	0.004743426322937)
		(0.0049186983108521	-0.03346760559082	0.0047320322990417)
		(0.0049982008934021	-0.03340799331665	0.0047135295867920006)
		(0.0050711393356323	-0.033341953277587995	0.0046901879310608)
		(0.0051441102027893005	-0.033279216766357006	0.0046584491729736)
		(0.0052146315574646	-0.033215641021729	0.004623569488525401)
		(0.0052821612358093005	-0.033153579711914	0.0045808310508728)
		(0.005347785949707	-0.033097480773926005	0.004527789592742901)
		(0.0054106202125548996	-0.033042766571045004	0.0044701085090637005)
		(0.0054739532470703	-0.03299084854126	0.0044104247093201005)
		(0.0055411067008972	-0.03294994354248	0.0043468632698059)
		(0.0055966353416443005	-0.032909320831299	0.0042728047370911)
		(0.0056415271759033	-0.032864402770996004	0.0041938714981079005)
		(0.005683696269989	-0.032820003509521	0.0041131310462952)
		(0.0057238345146179	-0.03277653121948201	0.0040308694839478005)
		(0.0057606120109558	-0.032736442565918	0.0039455561637878)
		(0.0057885499000549	-0.032696933746337996	0.0038566501140594)
		(0.0058110370635986	-0.032669269561768	0.0037621569633484)
		(0.0058229422569275	-0.032642017364502	0.0036655132770538)
		(0.0058334531784058	-0.032618087768555	0.0035677456855774)
		(0.0058365244865417	-0.032591827392577995	0.0034700100421906003)
		(0.0058340196609497	-0.03256526184082	0.0033723635673523)
		(0.0058203597068787	-0.032529151916504	0.0032787225246429)
		(0.005807813167572	-0.032494163513184	0.0031844525337219)
		(0.0057609405517578	-0.032485897064209	0.0031041476726532)
		(0.0017112861871719002	-0.034621864318848	0.0027308566570282)
	);
	// Optional: filter out points that haven't been found. Default	is to include them (with value -VGREAT)
	includeOutOfBounds  true;
}
