code/D21/system/probes_proximal_artery
probes_proximal_artery
{
    type            probes;
    libs            (sampling);

    // Name of the directory for probe data
    name            probes;

    // Write at same frequency as fields
    writeControl    outputTime;
    writeInterval   1;
    setFormat raw;
    surfaceFormat raw;

    // Fields to be probed
    fields          (U "p.*");

    // Optional: do not recalculate cells if mesh moves
    // Only cell interpolation can be applied when not using fixedLocations. 
    // InterpolationScheme entry will be ignored
    fixedLocations  true;

    // Optional: interpolation scheme to use (default is cell)
    interpolationScheme cellPoint;

    probeLocations
    (
		(0.0017209092378616	-0.033898502349854	-0.0013383437395096001)
		(0.0017067891359329	-0.033913307189941004	-0.001239325761795)
		(0.0017013889551163	-0.03393236541748	-0.001139649271965)
		(0.0016951711177826002	-0.033951030731201	-0.0010399383306503001)
		(0.0016893873214722	-0.033970077514648	-0.00094027704000473)
		(0.0016827039718628001	-0.033988506317139	-0.00084054899215698)
		(0.0016770081520081	-0.034007442474365	-0.0007408624291419999)
		(0.0016709845066071002	-0.034026252746582004	-0.0006411705017089801)
		(0.0016652703285217	-0.034045120239258	-0.00054148262739182)
		(0.0016588889360428002	-0.034063808441162004	-0.00044179618358612)
		(0.0016530680656433002	-0.034082736968994	-0.00034211987257004003)
		(0.0016468323469162002	-0.034101364135742	-0.00024240119755268)
		(0.0016408768892288	-0.034120227813721	-0.00014273616671562)
		(0.0016347551345825	-0.03413892745971701	-4.3026510626078e-05)
		(0.0016288645267487	-0.034157833099365	5.6658111512661e-05)
		(0.0016226873397827	-0.034176464080811	0.00015636749565601)
		(0.0016170531511307	-0.034195266723632996	0.00025609260797501)
		(0.0016122080087662002	-0.034213916778564	0.00035573318600655)
		(0.0016081725358963	-0.034233379364014	0.00045512905716896)
		(0.0016032989025116001	-0.034254692077637004	0.00055424433946609)
		(0.0015999565124512002	-0.034286373138428	0.00065063321590424)
		(0.0016037039756775	-0.034317497253418	0.00074715292453766)
		(0.001607714176178	-0.034347568511962995	0.00084394216537476)
		(0.0016158179044724	-0.034368713378906	0.00094293868541718)
		(0.0016214838027954	-0.034384265899658	0.0010430952310562002)
		(0.0016264859437943	-0.034399795532227	0.0011432939767838)
		(0.0016301069259644	-0.034417308807372995	0.0012432417869568)
		(0.0016345815658569002	-0.034437732696533	0.0013426524400711)
		(0.0016390758752823	-0.034457752227782995	0.0014420856237411)
		(0.0016412454843521	-0.034479454040527005	0.0015412409305573)
		(0.0016509716510773001	-0.034502704620361	0.0016394072771071999)
		(0.0016632061004639002	-0.034522850036621	0.001737898349762)
		(0.0016726716756821	-0.034543571472168	0.0018367947340012002)
		(0.0016820660829544001	-0.034565208435059	0.0019354360103607)
		(0.0016915417909622	-0.034589351654053	0.00203364777565)
		(0.0017028456926346	-0.03461251831054701	0.0021318793296814)
		(0.0017149027585983002	-0.034637500762939	0.0022293751239777)
		(0.0017195926904678002	-0.03466340637207	0.0023273029327393)
		(0.0017176957130432	-0.034679595947266	0.002426789522171)
		(0.0017133284807205002	-0.03467610168457	0.002526921749115)
		(0.0017108410596848001	-0.034659637451172	0.002624657869339)
		(0.0017112861871719002	-0.034621864318848	0.0027308566570282)
	);
	// Optional: filter out points that haven't been found. Default	is to include them (with value -VGREAT)
	includeOutOfBounds  true;
}
